app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		@user = current_user
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。